ARMmbed/mbed-os/targets/TARGET_Ambiq_Micro/TARGET_Apollo3/COMPONENT_lis2dh12/lis2dh12/lis2dh12_reg.h
#define LIS2DH12_OUT_X_L              0x28U
#define LIS2DH12_OUT_X_H              0x29U
#define LIS2DH12_OUT_Y_L              0x2AU
#define LIS2DH12_OUT_Y_H              0x2BU
#define LIS2DH12_OUT_Z_L              0x2CU
#define LIS2DH12_OUT_Z_H              0x2DU
#define LIS2DH12_FIFO_CTRL_REG        0x2EU
typedef struct {
  uint8_t fth               : 5;
  uint8_t tr                : 1;
  uint8_t fm                : 2;
} lis2dh12_fifo_ctrl_reg_t;

#define LIS2DH12_FIFO_SRC_REG         0x2FU
typedef struct {
  uint8_t fss               : 5;
  uint8_t empty             : 1;
  uint8_t ovrn_fifo         : 1;
  uint8_t wtm               : 1;
} lis2dh12_fifo_src_reg_t;

#define LIS2DH12_INT1_CFG             0x30U
typedef struct {
  uint8_t xlie              : 1;
  uint8_t xhie              : 1;
  uint8_t ylie              : 1;
  uint8_t yhie              : 1;
  uint8_t zlie              : 1;
  uint8_t zhie              : 1;
  uint8_t _6d               : 1;
  uint8_t aoi               : 1;
} lis2dh12_int1_cfg_t;

#define LIS2DH12_INT1_SRC             0x31U
typedef struct {
  uint8_t xl                : 1;
  uint8_t xh                : 1;
  uint8_t yl                : 1;
  uint8_t yh                : 1;
  uint8_t zl                : 1;
  uint8_t zh                : 1;
  uint8_t ia                : 1;
  uint8_t not_used_01       : 1;
} lis2dh12_int1_src_t;

#define LIS2DH12_INT1_THS             0x32U
typedef struct {
  uint8_t ths               : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_int1_ths_t;

#define LIS2DH12_INT1_DURATION        0x33U
typedef struct {
  uint8_t d                 : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_int1_duration_t;

#define LIS2DH12_INT2_CFG             0x34U
typedef struct {
  uint8_t xlie              : 1;
  uint8_t xhie              : 1;
  uint8_t ylie              : 1;
  uint8_t yhie              : 1;
  uint8_t zlie              : 1;
  uint8_t zhie              : 1;
  uint8_t _6d               : 1;
  uint8_t aoi               : 1;
} lis2dh12_int2_cfg_t;

#define LIS2DH12_INT2_SRC             0x35U
typedef struct {
  uint8_t xl                : 1;
  uint8_t xh                : 1;
  uint8_t yl                : 1;
  uint8_t yh                : 1;
  uint8_t zl                : 1;
  uint8_t zh                : 1;
  uint8_t ia                : 1;
  uint8_t not_used_01       : 1;
} lis2dh12_int2_src_t;

#define LIS2DH12_INT2_THS             0x36U
typedef struct {
  uint8_t ths               : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_int2_ths_t;

#define LIS2DH12_INT2_DURATION        0x37U
typedef struct {
  uint8_t d                 : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_int2_duration_t;

#define LIS2DH12_CLICK_CFG            0x38U
typedef struct {
  uint8_t xs                : 1;
  uint8_t xd                : 1;
  uint8_t ys                : 1;
  uint8_t yd                : 1;
  uint8_t zs                : 1;
  uint8_t zd                : 1;
  uint8_t not_used_01       : 2;
} lis2dh12_click_cfg_t;

#define LIS2DH12_CLICK_SRC            0x39U
typedef struct {
  uint8_t x                 : 1;
  uint8_t y                 : 1;
  uint8_t z                 : 1;
  uint8_t sign              : 1;
  uint8_t sclick            : 1;
  uint8_t dclick            : 1;
  uint8_t ia                : 1;
  uint8_t not_used_01       : 1;
} lis2dh12_click_src_t;

#define LIS2DH12_CLICK_THS            0x3AU
typedef struct {
  uint8_t ths               : 7;
  uint8_t lir_click         : 1;
} lis2dh12_click_ths_t;

#define LIS2DH12_TIME_LIMIT           0x3BU
typedef struct {
  uint8_t tli               : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_time_limit_t;

#define LIS2DH12_TIME_LATENCY         0x3CU
typedef struct {
  uint8_t tla               : 8;
} lis2dh12_time_latency_t;

#define LIS2DH12_TIME_WINDOW          0x3DU
typedef struct {
  uint8_t tw                : 8;
} lis2dh12_time_window_t;

#define LIS2DH12_ACT_THS              0x3EU
typedef struct {
  uint8_t acth              : 7;
  uint8_t not_used_01       : 1;
} lis2dh12_act_ths_t;

#define LIS2DH12_ACT_DUR              0x3FU
typedef struct {
  uint8_t actd              : 8;
} lis2dh12_act_dur_t;

/**
  * @defgroup LIS2DH12_Register_Union
  * @brief    This union group all the registers that has a bitfield
  *           description.
  *           This union is usefull but not need by the driver.
  *
  *           REMOVING this union you are complient with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union{
  lis2dh12_status_reg_aux_t status_reg_aux;
  lis2dh12_ctrl_reg0_t      ctrl_reg0;
  lis2dh12_temp_cfg_reg_t   temp_cfg_reg;
  lis2dh12_ctrl_reg1_t      ctrl_reg1;
  lis2dh12_ctrl_reg2_t      ctrl_reg2;
  lis2dh12_ctrl_reg3_t      ctrl_reg3;
  lis2dh12_ctrl_reg4_t      ctrl_reg4;
  lis2dh12_ctrl_reg5_t      ctrl_reg5;
  lis2dh12_ctrl_reg6_t      ctrl_reg6;
  lis2dh12_status_reg_t     status_reg;
  lis2dh12_fifo_ctrl_reg_t  fifo_ctrl_reg;
  lis2dh12_fifo_src_reg_t   fifo_src_reg;
  lis2dh12_int1_cfg_t       int1_cfg;
  lis2dh12_int1_src_t       int1_src;
  lis2dh12_int1_ths_t       int1_ths;
  lis2dh12_int1_duration_t  int1_duration;
  lis2dh12_int2_cfg_t       int2_cfg;
  lis2dh12_int2_src_t       int2_src;
  lis2dh12_int2_ths_t       int2_ths;
  lis2dh12_int2_duration_t  int2_duration;
  lis2dh12_click_cfg_t      click_cfg;
  lis2dh12_click_src_t      click_src;
  lis2dh12_click_ths_t      click_ths;
  lis2dh12_time_limit_t     time_limit;
  lis2dh12_time_latency_t   time_latency;
  lis2dh12_time_window_t    time_window;
  lis2dh12_act_ths_t        act_ths;
  lis2dh12_act_dur_t        act_dur;
  bitwise_t                 bitwise;
  uint8_t                   byte;
} lis2dh12_reg_t;

/**
  * @}
  *
  */

int32_t lis2dh12_read_reg(lis2dh12_ctx_t *ctx, uint8_t reg, uint8_t* data,
                          uint16_t len);
int32_t lis2dh12_write_reg(lis2dh12_ctx_t *ctx, uint8_t reg, uint8_t* data,
                           uint16_t len);

extern float lis2dh12_from_fs2_hr_to_mg(int16_t lsb);
extern float lis2dh12_from_fs4_hr_to_mg(int16_t lsb);
extern float lis2dh12_from_fs8_hr_to_mg(int16_t lsb);
extern float lis2dh12_from_fs16_hr_to_mg(int16_t lsb);
extern float lis2dh12_from_lsb_hr_to_celsius(int16_t lsb);

